{
  "ending": "The last trial was shuttering for Loki. He had to give up the rest of his humanity. However, now is not the moment to think about this. In front of Loki the great big door appeared, inscribed with more slavic runes. Loki did not know what they meant as this language is way older than he is, but written in bloody, gothic font, they couldn't mean anything good.\n\nAs the door start to open a loud scream reaches Loki's ears. It is even worse than than the newborns. It feels like it could shatter the reality itself. Loki crumbled and closed his eyes in pain. Suddenly the screaming stopped. As Loki opened his eyes he saw the ugliest and the fattest being he ever saw in his life. \n\n Loki immediately reached for the Fish Sword. Turned out it was just in time to block Veles' first attack. It came from below. Thousands of skeleton hands reached from beneath the ground trying to grab Loki's ankles and shutter them. With one swift strike he chopped all the hands right at the root. \nVeles nervously chuckled. \nLoki seeing that went for a frontal attack. But, as he shortened distance to his adversary by around half something started to feel wrong and Veles did not move an inch to avoid the attack. The ground became soft. Loki begun to sink, like in quicksand. Veles is not chuckling now, he is just all out laughing. More hands emerge from the ground pulling Loki even further inside the magic soil and blocking his movements and breaking Lokis bones as they press and pull harder and harder. \n\n'Is this the end?'\n\n'Am I going to die just like this?'\n\n'Wait... What is that button'\n\nIn the last second Loki felt a small button on the sword handle. It was hidden under a small ruby. As Loki pressed it, the sword started to heat up uncontrollably, but for some reason it did not burn Loki. Now on Veles face Loki saw only fear. He knew he is on the right track. With two swift cuts, one horizontal, one vertical, he cut the god of slavic underground in four pieces. At the moment the bloody pieces hit the ground the celling started to shutter but Loki could not move. With half of his bones broken he collapsed to the ground. \n\n'No this is how I die...'\n\nAs Lokis consciousness drifts away he is watching pieces of celling falling around him unveiling bright light that was above it. Seconds before Loki shuts down he can hear familiar voice right next to him and then darkness."
}